#Задание 1
В таблице t1 3 строки, в таблице t2 4 строки. Выполняется INNER JOIN по одному ключу.
Какие минимальное и максимальное количества строк могут быть в результате?

Минимальное - 0, потому что ключи из таблицы t1 могут отличаться от всех ключей из таблицы t2 =>
связей не будет.
Максимальное - 12 (3*4), так как все ключи из таблицы t1 могут равняться всем ключам из таблицы t2
(например, всегде будет ключ=1)



#Задание 2
В таблице t1 5 строк, в таблице t2 10 строк. Выполняется LEFT JOIN по одному ключу. 
Какие минимальное и максимальное количества строк могут быть в результате?

Минимальное - 5, потому что ключи могут не совпадать => связей не будет,но при left join у нас 
останутся все строки из таблицы, к которой мы присоединяем - это его фишка.

Максимальное - 50 (5*10), так как все ключи из t1 могут равняться всем ключам из таблицы t2(например, всегде
будет ключ=1)



#Задание 3
В таблице t1 7 строк, в таблице t2 2 строки. Выполняется FULL OUTER JOIN по одному ключу. 
Какие минимальное и максимальное количества строк могут быть в результате?

Минимальное - 7, потому что у первой таблицы могут быть ключи от 1 до 7, к примеру, а у
второй таблицы ключи 1 и 2 => по ключам 1 и 2 таблицы свяжутся, а оставшиеся значения (5 штук)
из первой таблицы будут обязаны вывестись - это фишка full outer join - он сохраняет все записи из
обеих таблиц.

Максимальное - 14 (7*2), так как ключ везде может быть одинаковый(например, всегде
будет ключ=1)



#Задание 4
В таблице t1 6 строк, в таблице t2 8 строк. Выполняется CROSS JOIN.
 Какие минимальное и максимальное количества строк могут быть в результате?

Минимальное и максимальное кол-во строк может получится 6*8=48, так как cross join делает 
декартовое произведение строк без какого-либо условия соединения.



#Задание 5
В таблице t1 2 строки, в таблице t2 3 строки, в таблице t3 4 строки. Выполняется INNER JOIN всех трех таблиц по одному ключу. 
Какие минимальное и максимальное количества строк могут быть в результате?

Минимальное - 0, так как ключи во всех таблицах могут быть разные => связей не будет.

Максимальное - 24 (2*3*4), так как ключ везде может быть одинаковый(например, всегде
будет ключ=1)



#Задание 6
Даны таблицы t1 и t2. Нужно вывести полную результирующую таблицу для INNER JOIN по условию t1.a = t2.a.

t1
id	a
1	A
2	A
3	B

t2
id	a
10	A
11	C
12	A

Результат:
1 A 10 A
2 A 10 A
1 A 12 A
2 A 12 A



#Задание 7
Даны таблицы t1 и t2. Нужно вывести полную результирующую таблицу для LEFT JOIN по условию t1.a = t2.a.

t1
id	a
1	A
2	B
3	B

t2
id	a
10	B
11	C
12	B

Результат:
1 A null null
2 B 10 B
3 B 10 B
2 B 12 B
3 B 12 B



#Задание 8
Даны таблицы t1 и t2. Нужно вывести полную результирующую таблицу для FULL OUTER JOIN по условию t1.a = t2.a.

t1
id	a
1	A
2	B
3	B

t2
id	a
10	B
11	C
12	B

Результат:
1 A null null
2 B 10 B
3 B 10 B
null null 11 C
2 B 12 B
3 B 12 B



#Задание 9
Даны таблицы t1 и t2. Нужно вывести полную результирующую таблицу для INNER JOIN 
по условию t1.a = t2.a. Обратите внимание на NULL.

t1
id	a
1	NULL
2	A
3	A

t2
id	a
10	NULL
11	A
12	B

Результат:
NULL = NULL => NULL

2 A 11 A
3 A 11 A



#Задание 10
Даны таблицы t1 и t2. Нужно вывести полную результирующую таблицу для INNER JOIN 
по условию t1.a = t2.a AND t1.b = t2.b.

t1
id	a	b
1	A	1
2	A	2
3	A	1

t2
id	a	b
10	A	1
11	A	1
12	A	3

Результат:
1 A 1 10 A 1
1 A 1 11 A 1
3 A 1 10 A 1
3 A 1 11 A 1